
const ng = [
	//Адлер
	{
		name: `//Адлер`,
		id: "8324ab10-fc52-405f-b4ad-245edf319766",
		data: [
			{
				d: new Date(2025, 11, 31),
				time: "11:00-20:00"
			},
			{
				d: new Date(2026, 0, 1),
				time: "12:00-23:00"
			},

		]
	},
	//Алушта, улица Ленина, 15
	{
		name: `//Алушта, улица Ленина, 15`,
		id: "8e118b94-5883-489f-b3da-aafd5781fdd4",
		data: [
			{
				d: new Date(2025, 11, 31),
				time: "11:00-21:00"
			},
			{
				d: new Date(2026, 0, 1),
				time: "12:00-23:00"
			},

		]
	},
	//Анапа, ул. Горького, д. 7а
	{
		name: `//Анапа, ул. Горького, д. 7а`,
		id: "aaa33897-fa94-4e85-a640-cca71d434820",
		data: [
			{
				d: new Date(2025, 11, 31),
				time: "11:00-17:00"
			},
			{
				d: new Date(2026, 0, 1),
				time: "13:00-23:00"
			},
			{
				d: new Date(2026, 0, 2),
				time: "11:00-23:00"
			},
			{
				d: new Date(2026, 0, 3),
				time: "11:00-23:00"
			},
			{
				d: new Date(2026, 0, 4),
				time: "11:00-23:00"
			},
			{
				d: new Date(2026, 0, 5),
				time: "11:00-23:00"
			},
			{
				d: new Date(2026, 0, 6),
				time: "11:00-23:00"
			},
			{
				d: new Date(2026, 0, 7),
				time: "11:00-23:00"
			},
			{
				d: new Date(2026, 0, 8),
				time: "11:00-23:00"
			},
			{
				d: new Date(2026, 0, 9),
				time: "11:00-23:00"
			},
			{
				d: new Date(2026, 0, 10),
				time: "11:00-23:00"
			}, {
				d: new Date(2026, 0, 11),
				time: "11:00-23:00"
			},
		]
	},
	//Анапа Омелькова
	{
		name: `//Анапа Омелькова`,
		id: "8afac979-2011-4bae-85b6-46a8d8e223e2",
		data: [
			{
				d: new Date(2025, 11, 31),
				time: "10:00-17:00"
			},
			{
				d: new Date(2026, 0, 1),
				time: "00:00-00:00"
			},
			{
				d: new Date(2026, 0, 2),
				time: "10:00-23:00"
			},
			{
				d: new Date(2026, 0, 3),
				time: "10:00-23:00"
			},
			{
				d: new Date(2026, 0, 4),
				time: "10:00-23:00"
			},
			{
				d: new Date(2026, 0, 5),
				time: "10:00-23:00"
			},
			{
				d: new Date(2026, 0, 6),
				time: "10:00-23:00"
			},
			{
				d: new Date(2026, 0, 7),
				time: "10:00-23:00"
			},
			{
				d: new Date(2026, 0, 8),
				time: "10:00-23:00"
			},
			{
				d: new Date(2026, 0, 9),
				time: "10:00-23:00"
			},
			{
				d: new Date(2026, 0, 10),
				time: "10:00-23:00"
			},
			{
				d: new Date(2026, 0, 11),
				time: "10:00-23:00"
			},

		]
	},
	//Астрахань, Кирова
	{
		name: `//Астрахань, Кирова`,
		id: "5c76cf67-7827-4c68-821b-8b8e8027a7e3",
		data: [
			{
				d: new Date(2025, 11, 31),
				time: "00:00-00:00"
			},
			{
				d: new Date(2026, 0, 1),
				time: "12:00-23:00"
			},
			{
				d: new Date(2026, 0, 2),
				time: "10:00-23:00"
			},
			{
				d: new Date(2026, 0, 3),
				time: "10:00-23:00"
			},
			{
				d: new Date(2026, 0, 4),
				time: "10:00-23:00"
			},
			{
				d: new Date(2026, 0, 5),
				time: "10:00-23:00"
			},
			{
				d: new Date(2026, 0, 6),
				time: "10:00-23:00"
			},
			{
				d: new Date(2026, 0, 7),
				time: "10:00-23:00"
			},
			{
				d: new Date(2026, 0, 8),
				time: "10:00-23:00"
			},
			{
				d: new Date(2026, 0, 9),
				time: "10:00-23:00"
			},


		]
	},
	//Барнаул, ТЦ Весна
	{
		name: `//Барнаул, ТЦ Весна`,
		id: "262d1c26-1eab-4fa7-ac95-73f5b0ecf11a",
		data: [
			{
				d: new Date(2025, 11, 31),
				time: "10:00-20:00"
			},
			{
				d: new Date(2026, 0, 1),
				time: "14:00-22:00"
			},

		]
	},
	//Бахчисарай, Симферопольская улица, 5А+
	{
		name: `//Бахчисарай, Симферопольская улица, 5А+`,
		id: "98d9a444-b7b9-4e50-8e9d-9924bd875788",
		data: [
			{
				d: new Date(2025, 11, 31),
				time: "00:00-00:00"
			},
			{
				d: new Date(2026, 0, 1),
				time: "00:00-00:00"
			},

		]
	},
	//Белгород б-р Народный
	{
		name: `//Белгород б-р Народный`,
		id: "0.4282903331477561",
		data: [
			{
				d: new Date(2025, 11, 31),
				time: "10:00-18:00"
			},
			{
				d: new Date(2026, 0, 1),
				time: "14:00-22:00"
			},

		]
	},
	//Белгород Сити Молл
	{
		name: `//Белгород Сити Молл`,
		id: "0.14975080498105187",
		data: [
			{
				d: new Date(2025, 11, 31),
				time: "10:00-20:00"
			},
			{
				d: new Date(2026, 0, 1),
				time: "12:00-22:00"
			},

		]
	},

	//Белгород, ТРК “Мега Гринн”
	{
		name: `//Белгород, ТРК “Мега Гринн”`,
		id: "0.07186552761806375",
		data: [
			{
				d: new Date(2025, 11, 31),
				time: "10:00-20:00"
			},
			{
				d: new Date(2026, 0, 1),
				time: "12:00-22:00"
			},

		]
	},
	//Белгород, свято-Троицкий бульвар, д. 1
	{
		name: `//Белгород, свято-Троицкий бульвар, д. 1`,
		id: "0.5162239644980637",
		data: [
			{
				d: new Date(2025, 11, 31),
				time: "10:00-18:00"
			},
			{
				d: new Date(2026, 0, 1),
				time: "14:00-22:00"
			},

		]
	},


	//Брянск ТЦ Аэропарк
	{
		name: `//Брянск ТЦ Аэропарк`,
		id: "52bbe299-72d5-4b6e-88cd-73faa728cd39",
		data: [
			{
				d: new Date(2025, 11, 31),
				time: "10:00-19:00"
			},
			{
				d: new Date(2026, 0, 1),
				time: "14:00-22:00"
			},

		]
	},

	//Бузулук
	{
		name: `//Бузулук`,
		id: "c4dc40b9-16ff-4405-be2e-368b9783dc04",
		data: [
			{
				d: new Date(2025, 11, 31),
				time: "00:00-00:00"
			},
			{
				d: new Date(2026, 0, 1),
				time: "00:00-00:00"
			},

		]
	},
	//Великий Новгород
	{
		name: `//Великий Новгород`,
		id: "f1200f5d-2990-4df7-a2ca-0ea7c2f27680",
		data: [
			{
				d: new Date(2025, 11, 31),
				time: "10:00-17:00"
			},
			{
				d: new Date(2026, 0, 1),
				time: "00:00-00:00"
			},

		]
	},
	//Верхняя Пышма
	{
		name: `//Верхняя Пышма`,
		id: "85fcf259-7c41-46c6-a30b-c0070d40da9c",
		data: [
			{
				d: new Date(2025, 11, 31),
				time: "00:00-00:00"
			},
			{
				d: new Date(2026, 0, 1),
				time: "00:00-00:00"
			},

		]
	},
	//Волгоград Коммунистическая
	{
		name: `//Волгоград Коммунистическая`,
		id: "bc51569a-174f-40e9-bc97-d4361e5b04c3",
		data: [
			{
				d: new Date(2025, 11, 31),
				time: "10:00-20:00"
			},
			{
				d: new Date(2026, 0, 1),
				time: "00:00-00:00"
			},

		]
	},
	//Вологда Марии Ульяновой
	{
		name: `//Вологда Марии Ульяновой`,
		id: "6c25145f-e6d3-4831-bd8f-62e0e741c1cb",
		data: [
			{
				d: new Date(2025, 11, 31),
				time: "11:00-16:00"
			},
			{
				d: new Date(2026, 0, 1),
				time: "15:00-23:00"
			},
			{
				d: new Date(2026, 0, 2),
				time: "11:00-23:00"
			},
			{
				d: new Date(2026, 0, 3),
				time: "11:00-23:00"
			},
			{
				d: new Date(2026, 0, 4),
				time: "11:00-23:00"
			},
			{
				d: new Date(2026, 0, 5),
				time: "11:00-23:00"
			},
			{
				d: new Date(2026, 0, 6),
				time: "11:00-23:00"
			},
			{
				d: new Date(2026, 0, 7),
				time: "11:00-23:00"
			},
			{
				d: new Date(2026, 0, 8),
				time: "11:00-23:00"
			},
			{
				d: new Date(2026, 0, 9),
				time: "11:00-23:00"
			},
			{
				d: new Date(2026, 0, 10),
				time: "11:00-23:00"
			},
			{
				d: new Date(2026, 0, 11),
				time: "11:00-23:00"
			},

		]
	},
	//Вологда Проспект Победы 21
	{
		name: `//Вологда Проспект Победы 21`,
		id: "f29f61e8-0bc1-41df-a27b-6dd29c25abef",
		data: [
			{
				d: new Date(2025, 11, 31),
				time: "11:00-16:00"
			},
			{
				d: new Date(2026, 0, 1),
				time: "15:00-23:00"
			},
			{
				d: new Date(2026, 0, 2),
				time: "11:00-23:00"
			},
			{
				d: new Date(2026, 0, 3),
				time: "11:00-23:00"
			},
			{
				d: new Date(2026, 0, 4),
				time: "11:00-23:00"
			},
			{
				d: new Date(2026, 0, 5),
				time: "11:00-23:00"
			},
			{
				d: new Date(2026, 0, 6),
				time: "11:00-23:00"
			},
			{
				d: new Date(2026, 0, 7),
				time: "11:00-23:00"
			},
			{
				d: new Date(2026, 0, 8),
				time: "11:00-23:00"
			},
			{
				d: new Date(2026, 0, 9),
				time: "11:00-23:00"
			},
			{
				d: new Date(2026, 0, 10),
				time: "11:00-23:00"
			},
			{
				d: new Date(2026, 0, 11),
				time: "11:00-23:00"
			},

		]
	},
	//Воронеж Никитинская
	{
		name: `//Воронеж Никитинская`,
		id: "0d664714-c67d-41df-9d89-7cf0f33139cf",
		data: [
			{
				d: new Date(2025, 11, 31),
				time: "10:00-17:00"
			},
			{
				d: new Date(2026, 0, 1),
				time: "14:00-23:00"
			},
			{
				d: new Date(2026, 0, 2),
				time: "10:00-23:00"
			},
			{
				d: new Date(2026, 0, 3),
				time: "10:00-23:00"
			},
			{
				d: new Date(2026, 0, 4),
				time: "10:00-23:00"
			},
			{
				d: new Date(2026, 0, 5),
				time: "10:00-23:00"
			},
			{
				d: new Date(2026, 0, 6),
				time: "10:00-23:00"
			},
			{
				d: new Date(2026, 0, 7),
				time: "10:00-23:00"
			},
			{
				d: new Date(2026, 0, 8),
				time: "10:00-23:00"
			},
			{
				d: new Date(2026, 0, 9),
				time: "10:00-23:00"
			},
			{
				d: new Date(2026, 0, 10),
				time: "10:00-23:00"
			},
			{
				d: new Date(2026, 0, 11),
				time: "10:00-23:00"
			},

		]
	},
	//Воронеж, Пушкинская
	{
		name: `//Воронеж, Пушкинская`,
		id: "39c0b2b4-ea7d-4748-93fa-3cce528b026a",
		data: [
			{
				d: new Date(2025, 11, 31),
				time: "10:00-17:00"
			},
			{
				d: new Date(2026, 0, 1),
				time: "14:00-23:00"
			},

		]
	},

	//Воронеж, бул. Победы, 23Б
	{
		name: `//Воронеж, бул. Победы, 23Б`,
		id: "f2040c04-31c5-4e28-a4b1-89e123b724a6",
		data: [
			{
				d: new Date(2025, 11, 31),
				time: "10:00-20:00"
			},
			{
				d: new Date(2026, 0, 1),
				time: "12:00-22:00"
			},

		]
	},

	//Воронеж, ул. 20-летия Октября, 88
	{
		name: `//Воронеж, ул. 20-летия Октября, 88`,
		id: "d7414ac1-82b0-4fb3-898c-f05718497c17",
		data: [
			{
				d: new Date(2025, 11, 31),
				time: "10:00-17:00"
			},
			{
				d: new Date(2026, 0, 1),
				time: "14:00-23:00"
			},
			{
				d: new Date(2026, 0, 2),
				time: "10:00-23:00"
			},
			{
				d: new Date(2026, 0, 3),
				time: "10:00-23:00"
			},
			{
				d: new Date(2026, 0, 4),
				time: "10:00-23:00"
			},
			{
				d: new Date(2026, 0, 5),
				time: "10:00-23:00"
			},
			{
				d: new Date(2026, 0, 6),
				time: "10:00-23:00"
			},
			{
				d: new Date(2026, 0, 7),
				time: "10:00-23:00"
			},
			{
				d: new Date(2026, 0, 8),
				time: "10:00-23:00"
			},
			{
				d: new Date(2026, 0, 9),
				time: "10:00-23:00"
			},
			{
				d: new Date(2026, 0, 10),
				time: "10:00-23:00"
			},
			{
				d: new Date(2026, 0, 11),
				time: "10:00-23:00"
			},
		]
	},


	//Воронеж ТРЦ "Московский проспект"
	{
		name: `//Воронеж ТРЦ "Московский проспект"`,
		id: "9d7a1538-ca07-4d9b-b292-8d15f29d7fee",
		data: [
			{
				d: new Date(2025, 11, 31),
				time: "10:00-20:00"
			},
			{
				d: new Date(2026, 0, 1),
				time: "14:00-22:00"
			},

		]
	},


	//Геленджик
	{
		name: `//Геленджик`,
		id: "6fd0903a-dba0-40b5-995f-f919031e23d4",
		data: [
			{
				d: new Date(2025, 11, 31),
				time: "00:00-00:00"
			},
			{
				d: new Date(2026, 0, 1),
				time: "13:00-23:00"
			},
			{
				d: new Date(2026, 0, 2),
				time: "10:00-23:00"
			},
			{
				d: new Date(2026, 0, 3),
				time: "10:00-23:00"
			},
			{
				d: new Date(2026, 0, 4),
				time: "10:00-23:00"
			},
			{
				d: new Date(2026, 0, 5),
				time: "10:00-23:00"
			},
			{
				d: new Date(2026, 0, 6),
				time: "10:00-23:00"
			},
			{
				d: new Date(2026, 0, 7),
				time: "10:00-23:00"
			},
			{
				d: new Date(2026, 0, 8),
				time: "10:00-23:00"
			},
			{
				d: new Date(2026, 0, 9),
				time: "10:00-23:00"
			},
			{
				d: new Date(2026, 0, 10),
				time: "10:00-23:00"
			},
			{
				d: new Date(2026, 0, 11),
				time: "10:00-23:00"
			},
		]
	},
	//Дмитров
	{
		name: `//Дмитров`,
		id: "b9b76693-ec28-4f93-aca8-91b83750ec74",
		data: [
			{
				d: new Date(2025, 11, 31),
				time: "00:00-00:00"
			},
			{
				d: new Date(2026, 0, 1),
				time: "16:00-22:00"
			},

		]
	},

	//Доброе
	{
		name: `//Доброе`,
		id: "34555507-b98d-464a-b0f0-774abd17d7ea",
		data: [
			{
				d: new Date(2025, 11, 31),
				time: "10:00-20:00"
			},
			{
				d: new Date(2026, 0, 1),
				time: "13:00-22:00"
			},
			{
				d: new Date(2026, 0, 6),
				time: "10:00-20:00"
			},

			{
				d: new Date(2026, 0, 7),
				time: "12:00-22:00"
			},


		]
	},

	//Евпатория Интернациональная  	
	{
		name: `//Евпатория Интернациональная  	`,
		id: "ab4d235c-c6ec-42f8-ac01-e876ad9acb92",
		data: [
			{
				d: new Date(2025, 11, 31),
				time: "00:00-00:00"
			},
			{
				d: new Date(2026, 0, 1),
				time: "00:00-00:00"
			},

		]
	},
	//Екатеринбург Мамина Сибиряка
	{
		name: `//Екатеринбург Мамина Сибиряка`,
		id: "982f1bef-772b-4443-9262-f10c4e4bcf7e",
		data: [
			{
				d: new Date(2025, 11, 31),
				time: "00:00-00:00"
			},
			{
				d: new Date(2026, 0, 1),
				time: "00:00-00:00"
			},

		]
	},

	//Екатеринбург Парк Хаус
	{
		name: `//Екатеринбург Парк Хаус`,
		id: "503a6ebe-cf92-4e6b-b96a-df6fff8ff593",
		data: [
			{
				d: new Date(2025, 11, 31),
				time: "10:00-20:00"
			},
			{
				d: new Date(2026, 0, 1),
				time: "14:00-22:00"
			},

		]
	},

	//Екатеринбург Павла Шаманова
	{
		name: `//Екатеринбург Павла Шаманова`,
		id: "d137612c-46e6-4055-b28f-7cf9e846a674",
		data: [
			{
				d: new Date(2025, 11, 31),
				time: "00:00-00:00"
			},
			{
				d: new Date(2026, 0, 1),
				time: "00:00-00:00"
			},

		]
	},

	//Екатеринбург 8 марта
	{
		name: `//Екатеринбург 8 марта`,
		id: "32a6390a-8fd8-4be7-b504-70007dbe0c8e",
		data: [
			{
				d: new Date(2025, 11, 31),
				time: "00:00-00:00"
			},
			{
				d: new Date(2026, 0, 1),
				time: "00:00-00:00"
			},

		]
	},

	//Екатеринбург ТРЦ Гринвич
	{
		name: `//Екатеринбург ТРЦ Гринвич`,
		id: "3d65ec85-2efe-43cd-898d-239e45328244",
		data: [
			{
				d: new Date(2025, 11, 31),
				time: "00:00-00:00"
			},
			{
				d: new Date(2026, 0, 1),
				time: "00:00-00:00"
			},

		]
	},


	//Екатеринбург Шварца
	{
		name: `//Екатеринбург Шварца`,
		id: "da40321e-4566-4507-9596-de55adaeaa31",
		data: [
			{
				d: new Date(2025, 11, 31),
				time: "00:00-00:00"
			},
			{
				d: new Date(2026, 0, 1),
				time: "00:00-00:00"
			},

		]
	},

	//Елец
	{
		name: `//Елец`,
		id: "fc66c24b-1f6f-4495-8563-e70cbd31a1df",
		data: [
			{
				d: new Date(2025, 11, 31),
				time: "11:00-17:00"
			},
			{
				d: new Date(2026, 0, 1),
				time: "14:00-23:00"
			},
			{
				d: new Date(2026, 0, 2),
				time: "11:00-23:00"
			},
			{
				d: new Date(2026, 0, 3),
				time: "11:00-23:00"
			},
			{
				d: new Date(2026, 0, 4),
				time: "11:00-23:00"
			},
			{
				d: new Date(2026, 0, 5),
				time: "11:00-23:00"
			},
			{
				d: new Date(2026, 0, 6),
				time: "11:00-23:00"
			},
			{
				d: new Date(2026, 0, 7),
				time: "11:00-23:00"
			},
			{
				d: new Date(2026, 0, 8),
				time: "11:00-23:00"
			},
			{
				d: new Date(2026, 0, 9),
				time: "11:00-23:00"
			},
			{
				d: new Date(2026, 0, 10),
				time: "11:00-23:00"
			},
			{
				d: new Date(2026, 0, 11),
				time: "11:00-23:00"
			},

		]
	},
	//Железногорск Ленина
	{
		name: `//Железногорск Ленина`,
		id: "8a418aae-1595-42cf-978b-2419844b765e",
		data: [
			{
				d: new Date(2025, 11, 31),
				time: "10:00-19:00"
			},
			{
				d: new Date(2026, 0, 1),
				time: "14:00-19:00"
			},

		]
	},
	//Иваново Дзержинского
	{
		name: `//Иваново Дзержинского`,
		id: "48ebe87b-6ec1-4d49-9908-b0dc9924210b",
		data: [
			{
				d: new Date(2025, 11, 31),
				time: "11:00-20:00"
			},
			{
				d: new Date(2026, 0, 1),
				time: "15:00-22:00"
			},


		]
	},

	//Иваново ТЦ Серебряный город
	{
		name: `//Иваново ТЦ Серебряный город`,
		id: "0a9a3b64-c2c4-4f3d-bc61-3c13782cec9d",
		data: [
			{
				d: new Date(2025, 11, 31),
				time: "10:00-20:00"
			},
			{
				d: new Date(2026, 0, 1),
				time: "00:00-00:00"
			},

		]
	},
	//Ижевск Берша
	{
		name: `//Ижевск Берша`,
		id: "3cce23a5-a726-4e58-8bfc-763309e168b0",
		data: [
			{
				d: new Date(2025, 11, 31),
				time: "10:00-18:00"
			},
			{
				d: new Date(2026, 0, 1),
				time: "16:00-22:00"
			},

		]
	},
	//Ижевск, ТЦ КИТ
	{
		name: `//Ижевск, ТЦ КИТ`,
		id: "8e3bf1ff-3ef7-4177-b04b-4ed37f9f3cc9",
		data: [
			{
				d: new Date(2025, 11, 31),
				time: "10:00-18:00"
			},
			{
				d: new Date(2026, 0, 1),
				time: "16:00-22:00"
			},

		]
	},
	//Ижевск, ул. Пушкинская, д.252
	{
		name: `//Ижевск, ул. Пушкинская, д.252`,
		id: "11663d0f-51a6-419d-8814-d3cb180eeab4",
		data: [
			{
				d: new Date(2025, 11, 31),
				time: "10:00-18:00"
			},
			{
				d: new Date(2026, 0, 1),
				time: "16:00-22:00"
			},

		]
	},
	//Казань Пушкина
	{
		name: `//Казань Пушкина`,
		id: "d335ac9c-217c-42de-bdf3-6eee3b208cd9",
		data: [
			{
				d: new Date(2025, 11, 31),
				time: "10:00-20:00"
			},
			{
				d: new Date(2026, 0, 1),
				time: "12:00-23:00"
			},

		]
	},

	//Казань Республика
	{
		name: `//Казань Республика`,
		id: "d4299ff5-f273-45b5-99b1-48afde2f2f6a",
		data: [
			{
				d: new Date(2025, 11, 31),
				time: "10:00-20:00"
			},
			{
				d: new Date(2026, 0, 1),
				time: "12:00-22:00"
			},

		]
	},

	//Казань Декабристов
	{
		name: `//Казань Декабристов`,
		id: "8ed84420-d94d-48ee-bf5e-90ec86a7f6bb",
		data: [
			{
				d: new Date(2025, 11, 31),
				time: "10:00-18:00"
			},
			{
				d: new Date(2026, 0, 1),
				time: "12:00-22:00"
			},

		]
	},

	//Казань Ямашива
	{
		name: `//Казань Ямашива`,
		id: "f07b55c0-1474-4c56-9609-cb251003eaa4",
		data: [
			{
				d: new Date(2025, 11, 31),
				time: "10:00-18:00"
			},
			{
				d: new Date(2026, 0, 1),
				time: "15:00-22:00"
			},

		]
	},
	//Казань, Чистопольская
	{
		name: `//Казань, Чистопольская`,
		id: "019e2b26-030e-4e59-a3c0-e615003415bd",
		data: [
			{
				d: new Date(2025, 11, 31),
				time: "10:00-20:00"
			},
			{
				d: new Date(2026, 0, 1),
				time: "14:00-23:00"
			},

		]
	},

	//Керчь, улица Ленина, 23
	{
		name: `//Керчь, улица Ленина, 23`,
		id: "bb7ed831-3b10-415a-bfe1-558f254427a3",
		data: [
			{
				d: new Date(2025, 11, 31),
				time: "10:00-19:00"
			},
			{
				d: new Date(2026, 0, 1),
				time: "14:00-22:00"
			},


		]
	},


	//Кострома (Коллаж), ТРЦ 'Коллаж'
	{
		name: `//Кострома (Коллаж), ТРЦ 'Коллаж'`,
		id: "93448991-df76-4320-a24d-5815d22082bf",
		data: [
			{
				d: new Date(2025, 11, 31),
				time: "11:00-19:00"
			},
			{
				d: new Date(2026, 0, 1),
				time: "13:00-23:00"
			},

			{
				d: new Date(2026, 0, 2),
				time: "11:00-23:00"
			},
			{
				d: new Date(2026, 0, 3),
				time: "11:00-23:00"
			},
			{
				d: new Date(2026, 0, 4),
				time: "11:00-23:00"
			},
			{
				d: new Date(2026, 0, 5),
				time: "11:00-23:00"
			},
			{
				d: new Date(2026, 0, 6),
				time: "11:00-23:00"
			},
			{
				d: new Date(2026, 0, 7),
				time: "11:00-23:00"
			},
			{
				d: new Date(2026, 0, 8),
				time: "11:00-23:00"
			},
			{
				d: new Date(2026, 0, 9),
				time: "11:00-23:00"
			},
			{
				d: new Date(2026, 0, 10),
				time: "11:00-23:00"
			},
			{
				d: new Date(2026, 0, 11),
				time: "11:00-22:00"
			},


		]
	},
	//Кострома, ул. Советская, д.2
	{
		name: `//Кострома, ул. Советская, д.2`,
		id: "012f36ea-4a57-4267-9104-90bd354b7037",
		data: [
			{
				d: new Date(2025, 11, 31),
				time: "11:00-19:00"
			},
			{
				d: new Date(2026, 0, 1),
				time: "13:00-23:00"
			},

			{
				d: new Date(2026, 0, 2),
				time: "11:00-23:00"
			},
			{
				d: new Date(2026, 0, 3),
				time: "11:00-23:00"
			},
			{
				d: new Date(2026, 0, 4),
				time: "11:00-23:00"
			},
			{
				d: new Date(2026, 0, 5),
				time: "11:00-23:00"
			},
			{
				d: new Date(2026, 0, 6),
				time: "11:00-23:00"
			},
			{
				d: new Date(2026, 0, 7),
				time: "11:00-23:00"
			},
			{
				d: new Date(2026, 0, 8),
				time: "11:00-23:00"
			},
			{
				d: new Date(2026, 0, 9),
				time: "11:00-23:00"
			},
			{
				d: new Date(2026, 0, 10),
				time: "11:00-23:00"
			},
			{
				d: new Date(2026, 0, 11),
				time: "11:00-22:00"
			},


		]
	},




	//Краснодар Мегамолл 
	{
		name: `//Краснодар Мегамолл `,
		id: "8fc38e88-d63f-4c10-9ee3-083d43f57e34",
		data: [
			{
				d: new Date(2025, 11, 31),
				time: "10:00-18:00"
			},
			{
				d: new Date(2026, 0, 1),
				time: "12:00-22:00"
			},

		]
	},
	//Краснодар Бочарникова
	{
		name: `//Краснодар Бочарникова`,
		id: "90018275-34f2-4ca1-80e4-5e8b68bccd77",
		data: [
			{
				d: new Date(2025, 11, 31),
				time: "10:00-18:00"
			},
			{
				d: new Date(2026, 0, 1),
				time: "13:00-22:00"
			},

		]
	},

	//Краснодар Центр Города
	{
		name: `//Краснодар Центр Города`,
		id: "b23b885f-4523-4e72-b4fe-137c0c6ac385",
		data: [
			{
				d: new Date(2025, 11, 31),
				time: "10:00-18:00"
			},
			{
				d: new Date(2026, 0, 1),
				time: "12:00-23:00"
			},
			{
				d: new Date(2026, 0, 2),
				time: "10:00-23:00"
			},
			{
				d: new Date(2026, 0, 3),
				time: "10:00-23:00"
			},
			{
				d: new Date(2026, 0, 4),
				time: "10:00-23:00"
			},
			{
				d: new Date(2026, 0, 5),
				time: "10:00-23:00"
			},
			{
				d: new Date(2026, 0, 6),
				time: "10:00-23:00"
			},
			{
				d: new Date(2026, 0, 7),
				time: "10:00-23:00"
			},
			{
				d: new Date(2026, 0, 8),
				time: "10:00-23:00"
			},
			{
				d: new Date(2026, 0, 9),
				time: "10:00-23:00"
			},
			{
				d: new Date(2026, 0, 10),
				time: "10:00-23:00"
			},

		]
	},
	//Краснодар Вестмол
	{
		name: `//Краснодар Вестмол`,
		id: "c4f1c400-5282-4986-9bec-6d46973d0a25",
		data: [
			{
				d: new Date(2025, 11, 31),
				time: "10:00-18:00"
			},
			{
				d: new Date(2026, 0, 1),
				time: "14:00-22:00"
			},

		]
	},
	//Краснодар ТЦ Сыр
	{
		name: `//Краснодар ТЦ Сыр`,
		id: "0dacf41c-6539-40bb-86f4-986a86a30b85",
		data: [
			{
				d: new Date(2025, 11, 31),
				time: "10:00-19:00"
			},
			{
				d: new Date(2026, 0, 1),
				time: "15:00-22:00"
			},

		]
	},

	//Краснодар МЕГАЦЕНТР Крас.прощ.
	{
		name: `//Краснодар МЕГАЦЕНТР Крас.прощ.`,
		id: "4616a576-c283-44af-b2a1-1b276875f405",
		data: [
			{
				d: new Date(2025, 11, 31),
				time: "10:00-20:00"
			},
			{
				d: new Date(2026, 0, 1),
				time: "15:00-22:00"
			},

		]
	},


	//Красноперекопск
	{
		name: `//Красноперекопск`,
		id: "e2b73f1f-f813-4a83-b2df-21e9054cbd15",
		data: [
			{
				d: new Date(2025, 11, 31),
				time: "10:00-20:00"
			},
			{
				d: new Date(2026, 0, 1),
				time: "15:00-22:00"
			},

		]
	},

	//Курган Гипер Сити
	{
		name: `//Курган Гипер Сити`,
		id: "0329d355-1151-46f7-b937-3fb899545504",
		data: [
			{
				d: new Date(2025, 11, 31),
				time: "10:00-20:00"
			},
			{
				d: new Date(2026, 0, 1),
				time: "00:00-00:00"
			},

		]
	},

	//Курск, ТРЦ 'Central Park', ул. Карла маркса, д.6 + плейсмат
	{
		name: `//Курск, ТРЦ 'Central Park', ул. Карла маркса, д.6 + плейсмат`,
		id: "0.5444956174307996",
		data: [
			{
				d: new Date(2025, 11, 31),
				time: "10:00-20:00"
			},
			{
				d: new Date(2026, 0, 1),
				time: "12:00-22:00"
			},

		]
	},
	//Курск, ТЦ «Европа 40», ул. Студенческая д. 1
	{
		name: `//Курск, ТЦ «Европа 40», ул. Студенческая д. 1`,
		id: "0.6553335452672011",
		data: [
			{
				d: new Date(2025, 11, 31),
				time: "10:00-20:00"
			},
			{
				d: new Date(2026, 0, 1),
				time: "12:00-21:00"
			},

		]
	},

	//Курск (ЦУМ), ул. Ленина 12
	{
		name: `//Курск (ЦУМ), ул. Ленина 12`,
		id: "0.7494251533374678",
		data: [
			{
				d: new Date(2025, 11, 31),
				time: "10:00-18:00"
			},
			{
				d: new Date(2026, 0, 1),
				time: "14:00-22:00"
			},

		]
	},




	//Курск, ул. Ленина 94
	{
		name: `//Курск, ул. Ленина 94`,
		id: "0.9920653930865655",
		data: [
			{
				d: new Date(2025, 11, 31),
				time: "10:00-18:00"
			},
			{
				d: new Date(2026, 0, 1),
				time: "14:00-22:00"
			},

		]
	},
	//Курск, ТЦ Мега ГРИНН, ул. Карла Маркса, д.68
	{
		name: `//Курск, ТЦ Мега ГРИНН, ул. Карла Маркса, д.68`,
		id: "0.9646014799369265",
		data: [
			{
				d: new Date(2025, 11, 31),
				time: "10:00-20:00"
			},
			{
				d: new Date(2026, 0, 1),
				time: "12:00-22:00"
			},

		]
	},
	//Курск ТЦ Манеж
	{
		name: `//Курск ТЦ Манеж`,
		id: "0.9772541030617252",
		data: [
			{
				d: new Date(2025, 11, 31),
				time: "10:00-18:00"
			},
			{
				d: new Date(2026, 0, 1),
				time: "14:00-22:00"
			},

		]
	},




	//Курчатов, ул. Энергетиков, д.52
	{
		name: `//Курчатов, ул. Энергетиков, д.52`,
		id: "0.2435483074337348",
		data: [
			{
				d: new Date(2025, 11, 31),
				time: "10:00-18:00"
			},
			{
				d: new Date(2026, 0, 1),
				time: "14:00-22:00"
			},

		]
	},
	//Кисловодск , Шаляпина 
	{
		name: `//Кисловодск , Шаляпина `,
		id: "df09e258-3c4b-40a2-adec-13fe57e0ac31",
		data: [
			{
				d: new Date(2025, 11, 31),
				time: "10:00-18:00"
			},
			{
				d: new Date(2026, 0, 1),
				time: "15:00-22:00"
			},

		]
	},

	//Липецк Зегеля
	{
		name: `//Липецк Зегеля`,
		id: "4762bf88-85f3-4c82-9a80-319c67cc385f",
		data: [
			{
				d: new Date(2025, 11, 31),
				time: "10:00-18:00"
			},
			{
				d: new Date(2026, 0, 1),
				time: "15:00-22:00"
			},

		]
	},
	//Липецк Советская
	{
		name: `//Липецк Советская`,
		id: "90a272bf-4e8e-46a0-b219-4b131c1825d1",
		data: [
			{
				d: new Date(2025, 11, 31),
				time: "10:00-17:00"
			},
			{
				d: new Date(2026, 0, 1),
				time: "16:00-22:00"
			},

		]
	},
	//Москва Большой Козловский
	{
		name: `//Москва Большой Козловский`,
		id: "f216ea03-18b3-4543-b856-5e7a90b33e92",
		data: [
			{
				d: new Date(2025, 11, 31),
				time: "00:00-00:00"
			},
			{
				d: new Date(2026, 0, 1),
				time: "00:00-00:00"
			},

		]
	},
	//Москва Волхонка 
	{
		name: `//Москва Волхонка `,
		id: "6e7d4406-8567-453e-a677-6e7c240d9083",
		data: [
			{
				d: new Date(2025, 11, 30),
				time: "11:00-19:00"
			},
			{
				d: new Date(2025, 11, 31),
				time: "11:00-19:00"
			},
			{
				d: new Date(2026, 0, 1),
				time: "16:00-23:00"
			},

		]
	},

	//Москва Мясницкая
	{
		name: `//Москва Мясницкая`,
		id: "1bb791ff-ce37-4402-8362-c5d0cb0ce57c",
		data: [
			{
				d: new Date(2025, 11, 30),
				time: "11:00-19:00"
			},
			{
				d: new Date(2025, 11, 31),
				time: "11:00-19:00"
			},
			{
				d: new Date(2026, 0, 1),
				time: "16:00-23:00"
			},

		]
	},

	//Москва Газетный
	{
		name: `//Москва Газетный`,
		id: "dd045ba5-3b1a-4e12-a97b-c9ccf67b8ea7",
		data: [
			{
				d: new Date(2025, 11, 31),
				time: "11:00-17:00"
			},
			{
				d: new Date(2026, 0, 1),
				time: "14:00-23:00"
			},

		]
	},

	//Москва Верхняя Радищевская  
	{
		name: `//Москва Верхняя Радищевская  `,
		id: "31d275d4-bc39-4a95-891d-510b4f9a95ce",
		data: [
			{
				d: new Date(2025, 11, 31),
				time: "11:00-17:00"
			},
			{
				d: new Date(2026, 0, 1),
				time: "14:00-23:00"
			},

		]
	},

	//Москва ТЦ ВТБ Арена
	{
		name: `//Москва ТЦ ВТБ Арена`,
		id: "2264861b-24aa-4f06-aef2-02ce4249eb90",
		data: [
			{
				d: new Date(2025, 11, 31),
				time: "11:00-18:00"
			},
			{
				d: new Date(2026, 0, 1),
				time: "00:00-00:00"
			},

		]
	},
	//Москва Пятницкий переулок
	{
		name: `//Москва Пятницкий переулок`,
		id: "0d6434e9-dae6-4f57-a552-3289b7c523da",
		data: [
			{
				d: new Date(2025, 11, 31),
				time: "11:00-17:00"
			},
			{
				d: new Date(2026, 0, 1),
				time: "15:00-23:00"
			},

		]
	},
	//Москва Арбат
	{
		name: `//Москва Арбат`,
		id: "c493985c-3998-4b83-9eea-f1bd2d516486",
		data: [
			{
				d: new Date(2025, 11, 31),
				time: "00:00-00:00"
			},
			{
				d: new Date(2026, 0, 1),
				time: "00:00-00:00"
			},

		]
	},
	//Мытищи ТЦ 4Daily
	{
		name: `//Мытищи ТЦ 4Daily`,
		id: "d8888bd2-7eb0-48f3-a7ae-80f7a684b420",
		data: [
			{
				d: new Date(2025, 11, 31),
				time: "11:00-20:00"
			},
			{
				d: new Date(2026, 0, 1),
				time: "16:00-22:00"
			},

		]
	},
	//Нижний Новгород Покровская
	{
		name: `//Нижний Новгород Покровская`,
		id: "20718057-bf2a-4036-9c7c-2b5daf6a614c",
		data: [
			{
				d: new Date(2025, 11, 31),
				time: "10:00-18:00"
			},
			{
				d: new Date(2026, 0, 1),
				time: "14:00-23:00"
			},

		]
	},
	//Нижний Новгород Жар-Птица
	{
		name: `//Нижний Новгород Жар-Птица`,
		id: "d6ecb21e-d95b-428b-a98f-12ba53ffbddf",
		data: [
			{
				d: new Date(2025, 11, 31),
				time: "10:00-18:00"
			},
			{
				d: new Date(2026, 0, 1),
				time: "14:00-22:00"
			},

		]
	},

	//Нижний Тагил Ленина
	{
		name: `//Нижний Тагил Ленина`,
		id: "5ace6991-a8b5-4127-b4d0-b7074cb6ccd8",
		data: [
			{
				d: new Date(2025, 11, 31),
				time: "00:00-00:00"
			},
			{
				d: new Date(2026, 0, 1),
				time: "00:00-00:00"
			},

		]
	},

	//Нижний Тагил Кировский
	{
		name: `//Нижний Тагил Кировский`,
		id: "2b0dfd94-7c7a-4dce-acd1-59de6f70856b",
		data: [
			{
				d: new Date(2025, 11, 31),
				time: "00:00-00:00"
			},
			{
				d: new Date(2026, 0, 1),
				time: "00:00-00:00"
			},

		]
	},
	//Нижний Тагил, Вагон 
	{
		name: `//Нижний Тагил, Вагон `,
		id: "b05c0fe5-4250-4c05-8b0f-51a66dd1dcd1",
		data: [
			{
				d: new Date(2025, 11, 31),
				time: "00:00-00:00"
			},
			{
				d: new Date(2026, 0, 1),
				time: "00:00-00:00"
			},

		]
	},

	//Новомосковск Комсомольская
	{
		name: `//Новомосковск Комсомольская`,
		id: "26836a54-db7f-4bfb-9687-391ae9d7137f",
		data: [
			{
				d: new Date(2025, 11, 31),
				time: "11:00-17:00"
			},
			{
				d: new Date(2026, 0, 1),
				time: "14:00-23:00"
			},
			{
				d: new Date(2026, 0, 2),
				time: "11:00-23:00"
			},
			{
				d: new Date(2026, 0, 3),
				time: "11:00-23:00"
			},
			{
				d: new Date(2026, 0, 4),
				time: "11:00-23:00"
			},
			{
				d: new Date(2026, 0, 5),
				time: "11:00-23:00"
			},
			{
				d: new Date(2026, 0, 6),
				time: "11:00-23:00"
			},
			{
				d: new Date(2026, 0, 7),
				time: "11:00-23:00"
			},
			{
				d: new Date(2026, 0, 8),
				time: "11:00-23:00"
			},
			{
				d: new Date(2026, 0, 9),
				time: "11:00-23:00"
			},
			{
				d: new Date(2026, 0, 10),
				time: "11:00-23:00"
			},
			{
				d: new Date(2026, 0, 11),
				time: "11:00-23:00"
			},

		]
	},

	//Новороссийск Адмирала Серебрякова
	{
		name: `//Новороссийск Адмирала Серебрякова`,
		id: "efba2381-8ff9-48b4-b9f9-99085d38e829",
		data: [
			{
				d: new Date(2025, 11, 31),
				time: "11:00-19:00"
			},
			{
				d: new Date(2026, 0, 1),
				time: "12:00-23:00"
			},

		]
	},
	//Новороссийск Красная площадб
	{
		name: `//Новороссийск Красная площадб`,
		id: "733fdb13-1dcd-4aef-8f81-5045a8a2023f",
		data: [
			{
				d: new Date(2025, 11, 31),
				time: "10:00-20:00"
			},
			{
				d: new Date(2026, 0, 1),
				time: "15:00-22:00"
			},

		]
	},
	//Новороссийск Дзержинского
	{
		name: `//Новороссийск Дзержинского`,
		id: "98a06c6e-36b9-4abe-b454-60cecf48f1d1",
		data: [
			{
				d: new Date(2025, 11, 31),
				time: "11:00-18:00"
			},
			{
				d: new Date(2026, 0, 1),
				time: "13:00-23:00"
			},

		]
	},
	//Оренбург ТЦ Мармелад
	{
		name: `//Оренбург ТЦ Мармелад`,
		id: "a6341fcd-0c89-4a22-b88c-2bb1126b1b07",
		data: [
			{
				d: new Date(2025, 11, 31),
				time: "10:00-20:00"
			},
			{
				d: new Date(2026, 0, 1),
				time: "14:00-21:00"
			},

		]
	},
	//Орёл Комсомольская
	{
		name: `//Орёл Комсомольская`,
		id: "0.23521520195517442",
		data: [
			{
				d: new Date(2025, 11, 31),
				time: "10:00-18:00"
			},
			{
				d: new Date(2026, 0, 1),
				time: "14:00-22:00"
			},

		]
	},
	//Орёл Комсомольская 2
	{
		name: `//Орёл Комсомольская 2`,
		id: "0.17206303100644427",
		data: [
			{
				d: new Date(2025, 11, 31),
				time: "10:00-18:00"
			},
			{
				d: new Date(2026, 0, 1),
				time: "14:00-22:00"
			},

		]
	},
	//Орёл Покровская
	{
		name: `//Орёл Покровская`,
		id: "0.9969633936871537",
		data: [
			{
				d: new Date(2025, 11, 31),
				time: "10:00-18:00"
			},
			{
				d: new Date(2026, 0, 1),
				time: "14:00-22:00"
			},

		]
	},

	//Орёл Октябрьская
	{
		name: `//Орёл Октябрьская`,
		id: "0.22310731554285135",
		data: [
			{
				d: new Date(2025, 11, 31),
				time: "10:00-18:00"
			},
			{
				d: new Date(2026, 0, 1),
				time: "14:00-22:00"
			},

		]
	},


	//Пенза Московская
	{
		name: `//Пенза Московская`,
		id: "902d043f-5b0c-4e39-b980-f514d4e4a671",
		data: [
			{
				d: new Date(2025, 11, 31),
				time: "10:00-18:00"
			},
			{
				d: new Date(2026, 0, 1),
				time: "16:00-22:00"
			},

		]
	},

	//Пермь Екатерининская
	{
		name: `//Пермь Екатерининская`,
		id: "64834e6b-37e7-4412-b4bc-82cfd339a233",
		data: [
			{
				d: new Date(2025, 11, 31),
				time: "10:00-18:00"
			},
			{
				d: new Date(2026, 0, 1),
				time: "00:00-00:00"
			},

		]
	},

	//Пермь Аймол
	{
		name: `//Пермь Аймол`,
		id: "c80f158d-1d05-492a-9e27-49aec2352859",
		data: [
			{
				d: new Date(2025, 11, 31),
				time: "10:00-20:00"
			},
			{
				d: new Date(2026, 0, 1),
				time: "15:00-22:00"
			},

		]
	},

	//Подольск ТРК Кварц
	{
		name: `//Подольск ТРК Кварц`,
		id: "ba094acd-21c7-4877-875d-060974043c78",
		data: [
			{
				d: new Date(2025, 11, 31),
				time: "10:00-20:00"
			},
			{
				d: new Date(2026, 0, 1),
				time: "14:00-22:00"
			},

		]
	},

	//Подольск Кирова
	{
		name: `//Подольск Кирова`,
		id: "ae85e64c-70a4-4d64-ad1c-a25eadb7ed4e",
		data: [
			{
				d: new Date(2025, 11, 31),
				time: "10:00-17:00"
			},
			{
				d: new Date(2026, 0, 1),
				time: "00:00-00:00"
			},

		]
	},
	//Ростов Большая Садовая
	{
		name: `//Ростов Большая Садовая`,
		id: "a80a4277-1604-4bdf-814a-3a0151d6e96b",
		data: [
			{
				d: new Date(2025, 11, 31),
				time: "10:00-17:00"
			},
			{
				d: new Date(2026, 0, 1),
				time: "14:00-23:00"
			},
			{
				d: new Date(2026, 0, 2),
				time: "10:00-23:00"
			},
			{
				d: new Date(2026, 0, 3),
				time: "10:00-23:00"
			},
			{
				d: new Date(2026, 0, 4),
				time: "10:00-23:00"
			},
			{
				d: new Date(2026, 0, 5),
				time: "10:00-23:00"
			},
			{
				d: new Date(2026, 0, 6),
				time: "10:00-23:00"
			},
			{
				d: new Date(2026, 0, 7),
				time: "10:00-23:00"
			},
			{
				d: new Date(2026, 0, 8),
				time: "10:00-23:00"
			},
			{
				d: new Date(2026, 0, 9),
				time: "10:00-23:00"
			},
			{
				d: new Date(2026, 0, 10),
				time: "10:00-23:00"
			}

		]
	},



	//Ростов Пушкинская
	{
		name: `//Ростов Пушкинская`,
		id: "d5940803-dcea-4d68-b00a-9aeb17234e73",
		data: [
			{
				d: new Date(2025, 11, 31),
				time: "10:00-17:00"
			},
			{
				d: new Date(2026, 0, 1),
				time: "14:00-23:00"
			},
			{
				d: new Date(2026, 0, 2),
				time: "10:00-23:00"
			},
			{
				d: new Date(2026, 0, 3),
				time: "10:00-23:00"
			},
			{
				d: new Date(2026, 0, 4),
				time: "10:00-23:00"
			},
			{
				d: new Date(2026, 0, 5),
				time: "10:00-23:00"
			},
			{
				d: new Date(2026, 0, 6),
				time: "10:00-23:00"
			},
			{
				d: new Date(2026, 0, 7),
				time: "10:00-23:00"
			},
			{
				d: new Date(2026, 0, 8),
				time: "10:00-23:00"
			},
			{
				d: new Date(2026, 0, 9),
				time: "10:00-23:00"
			},
			{
				d: new Date(2026, 0, 10),
				time: "10:00-23:00"
			},
			{
				d: new Date(2026, 0, 11),
				time: "10:00-23:00"
			},
		]
	},

	//Ростов Красноармейская
	{
		name: `//Ростов Красноармейская`,
		id: "01183e9a-1a13-4599-af58-ce1f7e83ea15",
		data: [
			{
				d: new Date(2025, 11, 31),
				time: "11:00-16:00"
			},
			{
				d: new Date(2026, 0, 1),
				time: "00:00-00:00"
			},

		]
	},
	//Рязань ТРЦ Малина
	{
		name: `//Рязань ТРЦ Малина`,
		id: "ee26813a-fab9-4d34-9478-7c92c0deacdb",
		data: [
			{
				d: new Date(2025, 11, 31),
				time: "10:00-20:00"
			},
			{
				d: new Date(2026, 0, 1),
				time: "12:00-22:00"
			},

		]
	},

	//Рыбинск Крестовая
	{
		name: `//Рыбинск Крестовая`,
		id: "93fc6c7f-a6c8-4743-9f61-f06c11a559ab",
		data: [
			{
				d: new Date(2025, 11, 31),
				time: "11:00-20:00"
			},
			{
				d: new Date(2026, 0, 1),
				time: "12:00-22:00"
			},
			{
				d: new Date(2026, 0, 2),
				time: "11:00-23:00"
			},
			{
				d: new Date(2026, 0, 3),
				time: "11:00-23:00"
			},
			{
				d: new Date(2026, 0, 4),
				time: "11:00-23:00"
			},
			{
				d: new Date(2026, 0, 5),
				time: "11:00-23:00"
			},
			{
				d: new Date(2026, 0, 6),
				time: "11:00-23:00"
			},
			{
				d: new Date(2026, 0, 7),
				time: "11:00-22:00"
			},
			{
				d: new Date(2026, 0, 8),
				time: "11:00-22:00"
			},
			{
				d: new Date(2026, 0, 9),
				time: "11:00-22:00"
			},
			{
				d: new Date(2026, 0, 10),
				time: "11:00-22:00"
			},
			{
				d: new Date(2026, 0, 11),
				time: "11:00-22:00"
			},

		]
	},

	//Самара ТЦ Эль Рио
	{
		name: `//Самара ТЦ Эль Рио`,
		id: "aea90533-8299-4e48-b5e5-cee98f200a32",
		data: [
			{
				d: new Date(2025, 11, 31),
				time: "11:00-19:00"
			},
			{
				d: new Date(2026, 0, 1),
				time: "13:00-22:00"
			},

		]
	},
	//Самара ТК Амбар
	{
		name: `//Самара ТК Амбар`,
		id: "4525dd0a-319b-4a47-8818-82b5d874d2ed",
		data: [
			{
				d: new Date(2025, 11, 31),
				time: "11:00-19:00"
			},
			{
				d: new Date(2026, 0, 1),
				time: "13:00-22:00"
			},

		]
	},

	//Самара Гудок
	{
		name: `//Самара Гудок`,
		id: "3d199f53-c9cd-45fc-a6ff-a249e112259a",
		data: [
			{
				d: new Date(2025, 11, 31),
				time: "11:00-19:00"
			},
			{
				d: new Date(2026, 0, 1),
				time: "13:00-22:00"
			},

		]
	},
	//Самара Садовая 
	{
		name: `//Самара Садовая `,
		id: "ac592b99-b5f2-42f6-9546-8147df3853a7",
		data: [
			{
				d: new Date(2025, 11, 31),
				time: "00:00-00:00"
			},
			{
				d: new Date(2026, 0, 1),
				time: "00:00-00:00"
			},

		]
	},

	//Самара LETOUT Аутлет Молл
	{
		name: `//Самара LETOUT Аутлет Молл`,
		id: "64c2bfe6-67c3-4b9a-b8c6-1cd9b91fa868",
		data: [
			{
				d: new Date(2025, 11, 31),
				time: "11:00-19:00"
			},
			{
				d: new Date(2026, 0, 1),
				time: "13:00-22:00"
			},

		]
	},

	//Самара Куйбышева
	{
		name: `//Самара Куйбышева`,
		id: "8890cd21-895d-42d4-a0bf-33ade54554bd",
		data: [
			{
				d: new Date(2025, 11, 31),
				time: "00:00-00:00"
			},
			{
				d: new Date(2026, 0, 1),
				time: "00:00-00:00"
			},

		]
	},
	//Санкт-Петербург Большой проспект
	{
		name: `//Санкт-Петербург Большой проспект`,
		id: "87302d41-6c3a-493c-bb76-0338cec6ddaf",
		data: [
			{
				d: new Date(2025, 11, 31),
				time: "00:00-00:00"
			},
			{
				d: new Date(2026, 0, 1),
				time: "00:00-00:00"
			},
		]
	},
	//Санкт-Петербург Загородный
	{
		name: `//Санкт-Петербург Загородный`,
		id: "bec1a072-44e5-46b7-9eb8-4ed28d8f644a",
		data: [
			{
				d: new Date(2025, 11, 31),
				time: "00:00-00:00"
			},
			{
				d: new Date(2026, 0, 1),
				time: "00:00-00:00"
			},

		]
	},
	//Санкт-Петербург Гончарная
	{
		name: `//Санкт-Петербург Гончарная`,
		id: "c30259b7-6902-4983-924c-c62d16140c99",
		data: [
			{
				d: new Date(2025, 11, 31),
				time: "00:00-00:00"
			},
			{
				d: new Date(2026, 0, 1),
				time: "00:00-00:00"
			},

		]
	},
	//Санкт-Петербург наб. Мойки
	{
		name: `//Санкт-Петербург наб. Мойки`,
		id: "e6b27b0e-5e58-4b52-bc96-50c8f2be45c8",
		data: [
			{
				d: new Date(2025, 11, 30),
				time: "11:00-20:00"
			},
			{
				d: new Date(2025, 11, 31),
				time: "00:00-00:00"
			},
			{
				d: new Date(2026, 0, 1),
				time: "15:00-23:00"
			},

		]
	},
	//Санкт-Петербург Науки
	{
		name: `//Санкт-Петербург Науки`,
		id: "c78f813b-1e6c-48af-a9a8-8751e4d00f33",
		data: [
			{
				d: new Date(2025, 11, 31),
				time: "00:00-00:00"
			},
			{
				d: new Date(2026, 0, 1),
				time: "00:00-00:00"
			},

		]
	},
	//Санкт-Петербург Фонтанка
	{
		name: `//Санкт-Петербург Фонтанка`,
		id: "464dd24d-be23-4bb6-802b-5de9bcb442bf",
		data: [
			{
				d: new Date(2025, 11, 31),
				time: "00:00-00:00"
			},
			{
				d: new Date(2026, 0, 1),
				time: "00:00-00:00"
			},

		]
	},






	//Саранск, улица Полежаева, 49
	{
		name: `//Саранск, улица Полежаева, 49`,
		id: "180fea4e-7455-4b0a-9aa5-2b817a0b4bca",
		data: [

			{
				d: new Date(2025, 11, 31),
				time: "10:00-18:00"
			},
			{
				d: new Date(2026, 0, 1),
				time: "14:00-22:00"
			},
			{
				d: new Date(2026, 0, 2),
				time: "10:00-22:00"
			},
			{
				d: new Date(2026, 0, 3),
				time: "10:00-22:00"
			},
			{
				d: new Date(2026, 0, 4),
				time: "10:00-22:00"
			},
			{
				d: new Date(2026, 0, 5),
				time: "10:00-22:00"
			},
			{
				d: new Date(2026, 0, 6),
				time: "10:00-22:00"
			},
			{
				d: new Date(2026, 0, 7),
				time: "10:00-22:00"
			},
			{
				d: new Date(2026, 0, 8),
				time: "10:00-22:00"
			},
			{
				d: new Date(2026, 0, 9),
				time: "10:00-22:00"
			},
			{
				d: new Date(2026, 0, 10),
				time: "10:00-22:00"
			},
			{
				d: new Date(2026, 0, 11),
				time: "10:00-22:00"
			},

		]
	},
	//Саранск, Гагарина 
	{
		name: `//Саранск, Гагарина `,
		id: "80270027-3e28-4101-aa57-65b972be22b3",
		data: [

			{
				d: new Date(2025, 11, 31),
				time: "10:00-18:00"
			},
			{
				d: new Date(2026, 0, 1),
				time: "14:00-22:00"
			},
			{
				d: new Date(2026, 0, 2),
				time: "10:00-22:00"
			},
			{
				d: new Date(2026, 0, 3),
				time: "10:00-22:00"
			},
			{
				d: new Date(2026, 0, 4),
				time: "10:00-22:00"
			},
			{
				d: new Date(2026, 0, 5),
				time: "10:00-22:00"
			},
			{
				d: new Date(2026, 0, 6),
				time: "10:00-22:00"
			},
			{
				d: new Date(2026, 0, 7),
				time: "10:00-22:00"
			},
			{
				d: new Date(2026, 0, 8),
				time: "10:00-22:00"
			},
			{
				d: new Date(2026, 0, 9),
				time: "10:00-22:00"
			},
			{
				d: new Date(2026, 0, 10),
				time: "10:00-22:00"
			},
			{
				d: new Date(2026, 0, 11),
				time: "10:00-22:00"
			},

		]
	},
	//Саратов Московская, 122/126
	{
		name: `//Саратов Московская, 122/126`,
		id: "1057f31b-e28f-4c8d-b5f2-0ca20b488861",
		data: [
			{
				d: new Date(2025, 11, 31),
				time: "00:00-00:00"
			},
			{
				d: new Date(2026, 0, 1),
				time: "16:00-22:00"
			},

		]
	},

	//Саратов Чапаева
	{
		name: `//Саратов Чапаева`,
		id: "13cbe943-f589-453e-a309-67f1733fd304",
		data: [
			{
				d: new Date(2025, 11, 31),
				time: "00:00-00:00"
			},
			{
				d: new Date(2026, 0, 1),
				time: "16:00-22:00"
			},

		]
	},
	//Севастополь, 6-я Бастионная улица, 42
	{
		name: `//Севастополь, 6-я Бастионная улица, 42`,
		id: "7fd74ec2-3f7e-4107-8efe-6f826cde60c9",
		data: [
			{
				d: new Date(2025, 11, 31),
				time: "10:00-18:00"
			},
			{
				d: new Date(2026, 0, 1),
				time: "14:00-22:00"
			},
			{
				d: new Date(2026, 0, 2),
				time: "10:00-22:00"
			},
			{
				d: new Date(2026, 0, 3),
				time: "10:00-22:00"
			},
			{
				d: new Date(2026, 0, 4),
				time: "10:00-22:00"
			},
			{
				d: new Date(2026, 0, 5),
				time: "10:00-22:00"
			},
			{
				d: new Date(2026, 0, 6),
				time: "10:00-22:00"
			},
			{
				d: new Date(2026, 0, 7),
				time: "10:00-22:00"
			},
			{
				d: new Date(2026, 0, 8),
				time: "10:00-22:00"
			},
			{
				d: new Date(2026, 0, 9),
				time: "10:00-22:00"
			},
			{
				d: new Date(2026, 0, 10),
				time: "10:00-22:00"
			},

		]
	},
	//Севастополь, Вакуленчука 20 «Ниагара»
	{
		name: `//Севастополь, Вакуленчука 20 «Ниагара»`,
		id: "d7f131c5-a7a4-4f66-95b4-c24c4c8b8b89",
		data: [
			{
				d: new Date(2025, 11, 31),
				time: "10:00-20:00"
			},
			{
				d: new Date(2026, 0, 1),
				time: "14:00-22:00"
			},

		]
	},

	//Севастополь, пр-т Генерала Острякова, 260 «Sea Mall»
	{
		name: `//Севастополь, пр-т Генерала Острякова, 260 «Sea Mall»`,
		id: "eb71f972-40be-4f67-81d3-7cbc4dba3122",
		data: [
			{
				d: new Date(2025, 11, 31),
				time: "10:00-20:00"
			},
			{
				d: new Date(2026, 0, 1),
				time: "00:00-00:00"
			},
			{
				d: new Date(2026, 0, 2),
				time: "14:00-22:00"
			},

		]
	},


	//Севастополь, улица Вакуленчука, 29/2 «Муссон»
	{
		name: `//Севастополь, улица Вакуленчука, 29/2 «Муссон»`,
		id: "d1c7a1cc-0f25-4e9e-af8d-6e4880a77768",
		data: [
			{
				d: new Date(2025, 11, 31),
				time: "10:00-20:00"
			},
			{
				d: new Date(2026, 0, 1),
				time: "14:00-22:00"
			},

		]
	},

	//Севастополь, набережная Парк Победы, 27 
	{
		name: `//Севастополь, набережная Парк Победы, 27 `,
		id: "aeb9ca75-4ef5-4727-b9e6-169d51b2e97b",
		data: [
			{
				d: new Date(2025, 11, 31),
				time: "00:00-00:00"
			},
			{
				d: new Date(2026, 0, 1),
				time: "14:00-22:00"
			},

		]
	},
	//Севастополь, проспект Нахимова, 5
	{
		name: `//Севастополь, проспект Нахимова, 5`,
		id: "ffbe6868-b9fe-4206-a9ef-14b1ad1f4d76",
		data: [
			{
				d: new Date(2025, 11, 31),
				time: "10:00-18:00"
			},
			{
				d: new Date(2026, 0, 1),
				time: "14:00-22:00"
			},

		]
	},

	//Сергиев Посад
	{
		name: `//Сергиев Посад`,
		id: "80684af0-9f1a-487c-87a6-849a48700619",
		data: [
			{
				d: new Date(2025, 11, 31),
				time: "00:00-00:00"
			},
			{
				d: new Date(2026, 0, 1),
				time: "00:00-00:00"
			},

		]
	},
	//Симферополь, Евпаторийское шоссе, 8 Меганом
	{
		name: `//Симферополь, Евпаторийское шоссе, 8 Меганом`,
		id: "7e84af92-6956-45ca-b343-2e8599fd9492",
		data: [
			{
				d: new Date(2025, 11, 31),
				time: "10:00-20:00"
			},
			{
				d: new Date(2026, 0, 1),
				time: "12:00-21:00"
			},
			{
				d: new Date(2025, 0, 6),
				time: "10:00-20:00"
			},

		]
	},
	//Симферополь, Киевская улица, 189 ЮГ
	{
		name: `//Симферополь, Киевская улица, 189 ЮГ`,
		id: "d1905b6e-08de-41f1-9a5f-8ed09fadbb28",
		data: [
			{
				d: new Date(2025, 11, 31),
				time: "10:00-20:00"
			},
			{
				d: new Date(2026, 0, 1),
				time: "14:00-20:00"
			},
			{
				d: new Date(2026, 0, 6),
				time: "10:00-20:00"
			},
			{
				d: new Date(2026, 0, 7),
				time: "14:00-20:00"
			},


		]
	},
	//Симферополь, Турецкая улица, 25
	{
		name: `//Симферополь, Турецкая улица, 25`,
		id: "7dcec94b-1109-439b-a27a-47ef897289ad",
		data: [
			{
				d: new Date(2025, 11, 31),
				time: "00:00-00:00"
			},
			{
				d: new Date(2026, 0, 1),
				time: "00:00-00:00"
			},

		]
	},
	//Симферополь, улица Павленко, 7А
	{
		name: `//Симферополь, улица Павленко, 7А`,
		id: "3d8f9512-f600-43bf-807d-3b9ff079a078",
		data: [
			{
				d: new Date(2025, 11, 31),
				time: "10:00-16:00"
			},
			{
				d: new Date(2026, 0, 1),
				time: "00:00-00:00"
			},

		]
	},

	//Симферополь, улица Пушкина, 11
	{
		name: `//Симферополь, улица Пушкина, 11`,
		id: "9f1ffb96-6392-4c00-aecc-f84fd5514ea6",
		data: [
			{
				d: new Date(2025, 11, 31),
				time: "10:00-20:00"
			},
			{
				d: new Date(2026, 0, 1),
				time: "13:00-22:00"
			},
			{
				d: new Date(2026, 0, 6),
				time: "10:00-20:00"
			},
			{
				d: new Date(2026, 0, 7),
				time: "12:00-22:00"
			},


		]
	},

	//Сочи, Егорова
	{
		name: `//Сочи, Егорова`,
		id: "48b05b9c-f73b-4026-91ad-bf41d87ff878",
		data: [
			{
				d: new Date(2025, 11, 31),
				time: "10:00-20:00"
			},
			{
				d: new Date(2026, 0, 1),
				time: "12:00-23:00"
			},


		]
	},
	//Смоленкс Макси 
	{
		name: `//Смоленкс Макси `,
		id: "70ac408d-9c16-4617-afb0-a554c742f923",
		data: [
			{
				d: new Date(2025, 11, 31),
				time: "10:00-20:00"
			},
			{
				d: new Date(2026, 0, 1),
				time: "12:00-21:00"
			},



		]
	},

	//Смоленск Галактика 
	{
		name: `//Смоленск Галактика `,
		id: "8178f928-db0f-442c-ae79-2346b11cb89a",
		data: [
			{
				d: new Date(2025, 11, 31),
				time: "10:00-17:00"
			},
			{
				d: new Date(2026, 0, 1),
				time: "00:00-00:00"
			},



		]
	},




	//Старый Оскол ТЦ Маскарад 
	{
		name: `//Старый Оскол ТЦ Маскарад `,
		id: "0.8024782558226105",
		data: [
			{
				d: new Date(2025, 11, 31),
				time: "10:00-18:00"
			},
			{
				d: new Date(2026, 0, 1),
				time: "15:00-21:00"
			},

		]
	},

	//Старый Оскол, ТРЦ 'Боше', мкрн. Ольминского, д. 17
	{
		name: `//Старый Оскол, ТРЦ 'Боше', мкрн. Ольминского, д. 17`,
		id: "0.1613637099754428",
		data: [
			{
				d: new Date(2025, 11, 31),
				time: "10:00-20:00"
			},
			{
				d: new Date(2026, 0, 1),
				time: "13:00-21:00"
			},

		]
	},



	//Ставрополь ПОР
	{
		name: `//Ставрополь ПОР`,
		id: "56942aab-69cc-47ec-b30f-e38a14d52eeb",
		data: [
			{
				d: new Date(2025, 11, 31),
				time: "11:00-15:00"
			},
			{
				d: new Date(2026, 0, 1),
				time: "18:00-23:00"
			},

		]
	},
	//Ставрополь П. Бурцева
	{
		name: `//Ставрополь П. Бурцева`,
		id: "858ab31f-49cd-4849-8fee-a1547ad556f7",
		data: [
			{
				d: new Date(2025, 11, 31),
				time: "11:00-15:00"
			},
			{
				d: new Date(2026, 0, 1),
				time: "18:00-23:00"
			},

		]
	},

	//Ставрополь ВКСМ
	{
		name: `//Ставрополь ВКСМ`,
		id: "2911487b-0d95-4db5-9830-90841bb98142",
		data: [
			{
				d: new Date(2025, 11, 31),
				time: "11:00-15:00"
			},
			{
				d: new Date(2026, 0, 1),
				time: "18:00-23:00"
			},

		]
	},

	//Таганрог
	{
		name: `//Таганрог`,
		id: "92eb0829-548a-4e64-8930-a60c8e2e5496",
		data: [
			{
				d: new Date(2025, 11, 31),
				time: "10:00-19:00"
			},
			{
				d: new Date(2026, 0, 1),
				time: "14:00-22:00"
			},
			{
				d: new Date(2026, 0, 2),
				time: "10:00-21:00"
			},
			{
				d: new Date(2026, 0, 3),
				time: "10:00-21:00"
			},
			{
				d: new Date(2026, 0, 4),
				time: "10:00-21:00"
			},
			{
				d: new Date(2026, 0, 5),
				time: "10:00-21:00"
			},
			{
				d: new Date(2026, 0, 6),
				time: "10:00-21:00"
			},
			{
				d: new Date(2026, 0, 7),
				time: "10:00-21:00"
			},
			{
				d: new Date(2026, 0, 8),
				time: "10:00-21:00"
			},
			{
				d: new Date(2026, 0, 9),
				time: "10:00-21:00"
			},
			{
				d: new Date(2026, 0, 10),
				time: "10:00-21:00"
			},
			{
				d: new Date(2026, 0, 11),
				time: "10:00-21:00"
			},

		]
	},

	//Тамбов Коммунальная
	{
		name: `//Тамбов Коммунальная`,
		id: "de892ee3-19e4-4347-a6f4-af6b938d55d4",
		data: [
			{
				d: new Date(2025, 11, 31),
				time: "10:00-18:00"
			},
			{
				d: new Date(2026, 0, 1),
				time: "00:00-00:00"
			},

		]
	},
	//Тамбов Мичуринская
	{
		name: `//Тамбов Мичуринская`,
		id: "595bab05-c629-48e4-9a5f-9abcabf75c36",
		data: [
			{
				d: new Date(2025, 11, 31),
				time: "10:00-18:00"
			},
			{
				d: new Date(2026, 0, 1),
				time: "00:00-00:00"
			},

		]
	},

	//Тверь Трёхсветская 14
	{
		name: `//Тверь Трёхсветская 14`,
		id: "74a4ef44-fe29-4be6-ac66-0f331a941521",
		data: [
			{
				d: new Date(2025, 11, 31),
				time: "10:00-18:00"
			},
			{
				d: new Date(2026, 0, 1),
				time: "00:00-00:00"
			},
			{
				d: new Date(2026, 0, 2),
				time: "10:00-23:00"
			},
			{
				d: new Date(2026, 0, 3),
				time: "10:00-23:00"
			},
			{
				d: new Date(2026, 0, 4),
				time: "10:00-23:00"
			},
			{
				d: new Date(2026, 0, 5),
				time: "10:00-23:00"
			},
			{
				d: new Date(2026, 0, 6),
				time: "10:00-23:00"
			},
			{
				d: new Date(2026, 0, 7),
				time: "10:00-23:00"
			},
			{
				d: new Date(2026, 0, 8),
				time: "10:00-23:00"
			},
			{
				d: new Date(2026, 0, 9),
				time: "10:00-23:00"
			},
			{
				d: new Date(2026, 0, 10),
				time: "10:00-23:00"
			},
			{
				d: new Date(2026, 0, 11),
				time: "10:00-23:00"
			},

		]
	},
	//Тула Красноармейский
	{
		name: `//Тула Красноармейский`,
		id: "bc8f5461-f8aa-432b-9c6c-3b0e9e7ec5f6",
		data: [
			{
				d: new Date(2025, 11, 31),
				time: "10:00-17:00"
			},
			{
				d: new Date(2026, 0, 1),
				time: "14:00-22:00"
			},
			{
				d: new Date(2026, 0, 2),
				time: "10:00-23:00"
			},
			{
				d: new Date(2026, 0, 3),
				time: "10:00-23:00"
			},
			{
				d: new Date(2026, 0, 4),
				time: "10:00-23:00"
			},
			{
				d: new Date(2026, 0, 5),
				time: "10:00-23:00"
			},
			{
				d: new Date(2026, 0, 6),
				time: "10:00-23:00"
			},
			{
				d: new Date(2026, 0, 7),
				time: "10:00-23:00"
			},
			{
				d: new Date(2026, 0, 8),
				time: "10:00-23:00"
			},
			{
				d: new Date(2026, 0, 9),
				time: "10:00-23:00"
			},
			{
				d: new Date(2026, 0, 10),
				time: "10:00-23:00"
			},

		]
	},
	//Тула Гостиный двор
	{
		name: `//Тула Гостиный двор`,
		id: "49e8a06b-a718-48a8-865c-d0cafbd7e309",
		data: [
			{
				d: new Date(2025, 11, 31),
				time: "10:00-20:00"
			},
			{
				d: new Date(2026, 0, 1),
				time: "12:00-22:00"
			},

		]
	},
	//Уфа Ультра -  макет на 2х языках
	{
		name: `//Уфа Ультра -  макет на 2х языках`,
		id: "e423a9a2-2997-46f2-acbe-ab142d164b93",
		data: [
			{
				d: new Date(2025, 11, 31),
				time: "10:00-20:00"
			},
			{
				d: new Date(2026, 0, 1),
				time: "00:00-00:00"
			},

		]
	},



	//Ульяновск Дворцовая
	{
		name: `//Ульяновск Дворцовая`,
		id: "fe5140b1-7b1a-4cae-87aa-1ced9e1e931c",
		data: [
			{
				d: new Date(2025, 11, 31),
				time: "11:00-18:00"
			},
			{
				d: new Date(2026, 0, 1),
				time: "00:00-00:00"
			},

		]
	},


	//Феодосия, ул. Федько 4
	{
		name: `//Феодосия, ул. Федько 4`,
		id: "5920d281-bd90-4073-b73a-15fdc3badc00",
		data: [
			{
				d: new Date(2025, 11, 31),
				time: "11:00-18:00"
			},
			{
				d: new Date(2026, 0, 1),
				time: "00:00-00:00"
			},

		]
	},
	//Челябинск Цвилинга
	{
		name: `//Челябинск Цвилинга`,
		id: "5fa4eb45-b794-4cd1-99ab-01fb15a0f0b5",
		data: [
			{
				d: new Date(2025, 11, 31),
				time: "00:00-00:00"
			},
			{
				d: new Date(2026, 0, 1),
				time: "15:00-23:00"
			},

		]
	},

	//Череповец, Горького
	{
		name: `//Череповец, Горького`,
		id: "88d3ee75-e481-4bb7-81a2-7169294e81e6",
		data: [
			{
				d: new Date(2025, 11, 31),
				time: "11:00-16:00"
			},
			{
				d: new Date(2026, 0, 1),
				time: "14:00-22:00"
			},

		]
	},
	//Шахты 
	{
		name: `//Шахты `,
		id: "826933a7-4f8f-4539-abab-305a0776eba0",
		data: [

			{
				d: new Date(2025, 11, 31),
				time: "10:00-23:00"
			},
			{
				d: new Date(2026, 0, 1),
				time: "10:00-23:00"
			},
			{
				d: new Date(2026, 0, 2),
				time: "10:00-23:00"
			},
			{
				d: new Date(2026, 0, 3),
				time: "10:00-23:00"
			},
			{
				d: new Date(2026, 0, 4),
				time: "10:00-23:00"
			},
			{
				d: new Date(2026, 0, 5),
				time: "10:00-23:00"
			},
			{
				d: new Date(2026, 0, 6),
				time: "10:00-23:00"
			},
			{
				d: new Date(2026, 0, 7),
				time: "10:00-23:00"
			},
			{
				d: new Date(2026, 0, 8),
				time: "10:00-23:00"
			},
			{
				d: new Date(2026, 0, 9),
				time: "10:00-23:00"
			},
			{
				d: new Date(2026, 0, 10),
				time: "10:00-23:00"
			},
			{
				d: new Date(2026, 0, 11),
				time: "10:00-23:00"
			},

		]
	},
	//Электросталь
	{
		name: `//Электросталь`,
		id: "1ee834ee-4baf-4629-a311-81c658369b46",
		data: [
			{
				d: new Date(2025, 11, 31),
				time: "10:00-19:00"
			},
			{
				d: new Date(2026, 0, 1),
				time: "15:00-22:00"
			},

		]
	},
	//Ялта, улица Боткинская
	{
		name: `//Ялта, улица Боткинская`,
		id: "dbd5ee14-5153-45fe-b7e4-771aee93a502",
		data: [
			{
				d: new Date(2025, 11, 31),
				time: "10:00-19:00"
			},
			{
				d: new Date(2026, 0, 1),
				time: "13:00-00:00"
			},
			{
				d: new Date(2026, 0, 2),
				time: "10:00-00:00"
			},
			{
				d: new Date(2026, 0, 3),
				time: "10:00-00:00"
			},
			{
				d: new Date(2026, 0, 4),
				time: "10:00-00:00"
			},
			{
				d: new Date(2026, 0, 5),
				time: "10:00-00:00"
			},
			{
				d: new Date(2026, 0, 6),
				time: "10:00-00:00"
			},
			{
				d: new Date(2026, 0, 7),
				time: "10:00-00:00"
			},
			{
				d: new Date(2026, 0, 8),
				time: "10:00-00:00"
			},
			{
				d: new Date(2026, 0, 9),
				time: "10:00-00:00"
			},
			{
				d: new Date(2026, 0, 10),
				time: "10:00-00:00"
			},
			{
				d: new Date(2026, 0, 11),
				time: "10:00-23:00"
			},

		]
	},

	//Ялта, улица Игнатенко, 20
	{
		name: `//Ялта, улица Игнатенко, 20`,
		id: "d93eca6d-3aec-4417-b326-250399a586ca",
		data: [
			{
				d: new Date(2025, 11, 31),
				time: "10:00-19:00"
			},
			{
				d: new Date(2026, 0, 1),
				time: "13:00-00:00"
			},
			{
				d: new Date(2026, 0, 2),
				time: "10:00-23:00"
			},
			{
				d: new Date(2026, 0, 3),
				time: "10:00-23:00"
			},
			{
				d: new Date(2026, 0, 4),
				time: "10:00-23:00"
			},
			{
				d: new Date(2026, 0, 5),
				time: "10:00-23:00"
			},
			{
				d: new Date(2026, 0, 6),
				time: "10:00-23:00"
			},
			{
				d: new Date(2026, 0, 7),
				time: "10:00-23:00"
			},
			{
				d: new Date(2026, 0, 8),
				time: "10:00-23:00"
			},
			{
				d: new Date(2026, 0, 9),
				time: "10:00-23:00"
			},
			{
				d: new Date(2026, 0, 10),
				time: "10:00-23:00"
			},
			{
				d: new Date(2026, 0, 11),
				time: "10:00-22:00"
			},

		]
	},
	//Ярославль Нахимсона
	{
		name: `//Ярославль Нахимсона`,
		id: "90fd8b1c-b367-4a29-a808-3c10c55329b1",
		data: [
			{
				d: new Date(2025, 11, 31),
				time: "11:00-20:00"
			},
			{
				d: new Date(2026, 0, 1),
				time: "15:00-23:00"
			},
			{
				d: new Date(2026, 0, 2),
				time: "11:00-23:00"
			},
			{
				d: new Date(2026, 0, 3),
				time: "11:00-23:00"
			},
			{
				d: new Date(2026, 0, 4),
				time: "11:00-23:00"
			},
			{
				d: new Date(2026, 0, 5),
				time: "11:00-23:00"
			},
			{
				d: new Date(2026, 0, 6),
				time: "11:00-23:00"
			},
			{
				d: new Date(2026, 0, 7),
				time: "11:00-23:00"
			},
			{
				d: new Date(2026, 0, 8),
				time: "11:00-23:00"
			},
			{
				d: new Date(2026, 0, 9),
				time: "11:00-23:00"
			},
			{
				d: new Date(2026, 0, 10),
				time: "11:00-23:00"
			},
			{
				d: new Date(2026, 0, 11),
				time: "11:00-23:00"
			},

		]
	},
	//Ярославль Кирова
	{
		name: `//Ярославль Кирова`,
		id: "0570ba49-f045-4b6e-aad4-cdd3d4924517",
		data: [
			{
				d: new Date(2025, 11, 31),
				time: "11:00-20:00"
			},
			{
				d: new Date(2026, 0, 1),
				time: "13:00-23:00"
			},
			{
				d: new Date(2026, 0, 2),
				time: "10:00-23:00"
			},
			{
				d: new Date(2026, 0, 3),
				time: "10:00-23:00"
			},
			{
				d: new Date(2026, 0, 4),
				time: "10:00-23:00"
			},
			{
				d: new Date(2026, 0, 5),
				time: "10:00-23:00"
			},
			{
				d: new Date(2026, 0, 6),
				time: "10:00-23:00"
			},
			{
				d: new Date(2026, 0, 7),
				time: "10:00-23:00"
			},
			{
				d: new Date(2026, 0, 8),
				time: "10:00-23:00"
			},
			{
				d: new Date(2026, 0, 9),
				time: "10:00-23:00"
			},
			{
				d: new Date(2026, 0, 10),
				time: "10:00-23:00"
			},


		]
	},
	//Ярославль Свободы
	{
		name: `//Ярославль Свободы`,
		id: "d7c79a4a-a2ce-4329-8b51-4198227741fa",
		data: [
			{
				d: new Date(2025, 11, 31),
				time: "11:00-20:00"
			},
			{
				d: new Date(2026, 0, 1),
				time: "15:00-23:00"
			},
			{
				d: new Date(2026, 0, 2),
				time: "11:00-23:00"
			},

			{
				d: new Date(2026, 0, 3),
				time: "11:00-23:00"
			},
			{
				d: new Date(2026, 0, 4),
				time: "11:00-23:00"
			},
			{
				d: new Date(2026, 0, 5),
				time: "11:00-23:00"
			},
			{
				d: new Date(2026, 0, 6),
				time: "11:00-23:00"
			},
			{
				d: new Date(2026, 0, 7),
				time: "11:00-23:00"
			},
			{
				d: new Date(2026, 0, 8),
				time: "11:00-23:00"
			},
			{
				d: new Date(2026, 0, 9),
				time: "11:00-23:00"
			},
			{
				d: new Date(2026, 0, 10),
				time: "11:00-23:00"
			},


		]
	},

	//Ярославль Флагман
	{
		name: `//Ярославль Флагман`,
		id: "2e82bedd-62f9-4f85-a616-fa9f1beb4263",
		data: [
			{
				d: new Date(2025, 11, 31),
				time: "11:00-20:00"
			},
			{
				d: new Date(2026, 0, 1),
				time: "15:00-22:00"
			},
			{
				d: new Date(2026, 0, 2),
				time: "11:00-23:00"
			},

			{
				d: new Date(2026, 0, 3),
				time: "11:00-23:00"
			},
			{
				d: new Date(2026, 0, 4),
				time: "11:00-23:00"
			},
			{
				d: new Date(2026, 0, 5),
				time: "11:00-23:00"
			},
			{
				d: new Date(2026, 0, 6),
				time: "11:00-23:00"
			},
			{
				d: new Date(2026, 0, 7),
				time: "11:00-23:00"
			},
			{
				d: new Date(2026, 0, 8),
				time: "11:00-23:00"
			},
			{
				d: new Date(2026, 0, 9),
				time: "11:00-23:00"
			},
			{
				d: new Date(2026, 0, 10),
				time: "11:00-23:00"
			},
			{
				d: new Date(2026, 0, 11),
				time: "11:00-23:00"
			},


		]
	},
	//Майкоп
	{
		name: `//Майкоп`,
		id: "3bdb0b6e-98d8-4a64-98ba-cdce92f844f1",
		data: [
			{
				d: new Date(2025, 11, 31),
				time: "10:00-20:00"
			},
			{
				d: new Date(2026, 0, 1),
				time: "13:00-22:00"
			},

		]
	},


	//Воронеж ТЦ Максимир
	{
		name: `//Воронеж ТЦ Максимир`,
		id: "961b93a2-6a81-4925-a593-315b0e8b4cb5",
		data: [
			{
				d: new Date(2025, 11, 31),
				time: "10:00-20:00"
			},
			{
				d: new Date(2026, 0, 1),
				time: "13:00-22:00"
			},


		]
	},

	//Омск
	{
		name: `//Омск`,
		id: "859baa95-64f8-4313-ae5c-e39e59e773a6",
		data: [
			{
				d: new Date(2025, 11, 31),
				time: "00:00-00:00"
			},
			{
				d: new Date(2026, 0, 1),
				time: "00:00-00:00"
			},


		]
	},

	//Михайловск
	{
		name: `//Михайловск`,
		id: "fd10e1f7-42ad-4f71-bf43-45a108cb0d5f",
		data: [
			{
				d: new Date(2025, 11, 31),
				time: "10:00-18:00"
			},
			{
				d: new Date(2026, 0, 1),
				time: "15:00-22:00"
			},
		]
	}
]

const trueDate = new Date();
function formatDate(date: any) {
	var dd: any = date.getDate();
	if (dd < 10) dd = '0' + dd;

	var mm: any = date.getMonth() + 1;
	if (mm < 10) mm = '0' + mm;

	var yy: any = date.getFullYear() % 100;
	if (yy < 10) yy = '0' + yy;

	return dd + '.' + mm + '.' + yy;
}
export const ngFNs = (org: any) => {

	let time: any;

	ng.forEach((val: any) => {
		if (val.id == org) {
			val.data.forEach((value: any) => {
				if (formatDate(trueDate) === formatDate(value.d)) {
					//console.log(value.time);
					time = value.time;
				}
			});
		}
	});

	return time;
}

export const fnNG = (org: any, workTime: string[]) => {
	let tt: any

	function updateWorkTime(workTime, work) {
		const today = new Date(); // текущая дата

		const startOfWeek = new Date(today);
		startOfWeek.setDate(today.getDate() - (today.getDay() === 0 ? 6 : today.getDay() - 1));
		startOfWeek.setHours(0, 0, 0, 0);

		// Получаем конец текущей недели (воскресенье)
		const endOfWeek = new Date(startOfWeek);
		endOfWeek.setDate(startOfWeek.getDate() + 6);
		endOfWeek.setHours(23, 59, 59, 999);

		// Обходим каждый объект в массиве work
		work.forEach((entry) => {
			const workDate = entry.d;

			// Проверяем, входит ли дата в текущую неделю
			if (workDate >= startOfWeek && workDate <= endOfWeek) {
				// Вычисляем индекс дня недели (0 - воскресенье, 1 - понедельник, ...)
				const dayIndex = workDate.getDay() === 0 ? 6 : workDate.getDay() - 1;

				// Обновляем время в workTime по индексу дня недели
				if (workTime[dayIndex]) {
					workTime[dayIndex] = entry.time;
				}
			}
		});


		return workTime;
	}

	ng.forEach((val: any) => {
		if (val.id == org) {
			tt = updateWorkTime(workTime, val.data);
		} else {
			tt = workTime
		}
	});


	return tt
}